package handlers

import (
	"log"

	"BastetTetlegram/internal/services"
	tgbotapi "github.com/go-telegram-bot-api/telegram-bot-api/v5"
)

type HelpHandler struct {
	bot *tgbotapi.BotAPI
}

func NewHelpHandler(bot *tgbotapi.BotAPI) *HelpHandler {
	return &HelpHandler{
		bot: bot,
	}
}

func (h *HelpHandler) Handle(update tgbotapi.Update) {
	// Обратите внимание: встроенная ссылка [разработчику бота](tg://user?id=435809098) была проблемой ранее.
	// Если мы экранируем весь текст, она не будет работать.
	// Для надежности, уберем форматирование ссылки из этого сообщения.
	originalText := "Привет👋! Это свободная разработка. По вопросам обращайтесь к разработчику бота (tg://user?id=435809098) 📬.\n" +
		" Спасибо за вашу обратную связь😊!\n\nБазовые команды:\n" +
		"- `/gpt` - Получите текстовые ответы на ваши вопросы с помощью *GPT4o*.\n" +
		"- `/imagine` - Создайте изображения на основе вашего описания.\n" +
		"- `/q` - Получите случайную цитату.\n" +
		"- `/toast` - Получите случайный тост.\n"

	// Вариант 2: С экранированием (форматирование не работает, но надежно)
	escapedText := services.EscapeMarkdownV2(originalText)
	msg := tgbotapi.NewMessage(update.Message.Chat.ID, escapedText)

	msg.ParseMode = "MarkdownV2"
	_, err := h.bot.Send(msg)
	if err != nil {
		log.Printf("Ошибка при отправке сообщения /help: %v", err)
	}
}
